In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [4]:
m = 1
m + n

nan

In [5]:
s1 = Series([1,2, np.nan, 3,4], index=['A','B','C','D','E'])

In [6]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [7]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [8]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [9]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

In [12]:
df1 = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,8],[np.nan,np.nan,np.nan]])

In [13]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0
3  NaN  NaN  NaN

In [14]:
df1.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [15]:
df1.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [24]:
df2 = df1.dropna(axis=0, how='all'，thresh>2)# 参数：行数，any和all，空参大于2，

In [26]:
df2.fillna(value=1)#填充数据

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  8.0

In [28]:
df2.fillna(value={0:0,1:1,2:2})#指定填充，第一列填充0，第二列填充1

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  1.0  8.0